# üß™ Data Analysis Practice Notebook
This notebook demonstrates data analysis tasks using **Pandas**, **NumPy**, **Matplotlib**, and SQL integration with SQLAlchemy.

## üì¶ Import Required Libraries

In [12]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## üìù Create Sample Dataset

In [54]:
data_raw = [
    {'Name': 'Alice', 'Age': 25, 'Department': 'HR', 'Salary': 50000},
    {'Name': 'Bob', 'Age': 30, 'Department': 'IT', 'Salary': 60000},
    {'Name': 'Charlie', 'Age': 28, 'Department': 'Finance', 'Salary': 55000},
    {'Name': 'David', 'Age': 35, 'Department': 'IT', 'Salary': 70000},
    {'Name': 'Eva', 'Age': 40, 'Department': 'HR', 'Salary': 65000}
]

## üìä Convert to DataFrame and Display

In [55]:
df = pd.DataFrame(data_raw)
df

      Name  Age Department  Salary
0    Alice   25         HR   50000
1      Bob   30         IT   60000
2  Charlie   28    Finance   55000
3    David   35         IT   70000
4      Eva   40         HR   65000

## üî† Sort Columns Alphabetically

In [15]:
df.sort_index(axis=1)

   Age Department     Name  Salary
0   25         HR    Alice   50000
1   30         IT      Bob   60000
2   28    Finance  Charlie   55000
3   35         IT    David   70000
4   40         HR      Eva   65000

## üî§ Sort by Name Alphabetically

In [16]:
df.sort_values(by='Name')

      Name  Age Department  Salary
0    Alice   25         HR   50000
1      Bob   30         IT   60000
2  Charlie   28    Finance   55000
3    David   35         IT   70000
4      Eva   40         HR   65000

## üìâ Sort Columns in Reverse Order

In [17]:
df.sort_index(axis=1, ascending=False)

   Salary     Name Department  Age
0   50000    Alice         HR   25
1   60000      Bob         IT   30
2   55000  Charlie    Finance   28
3   70000    David         IT   35
4   65000      Eva         HR   40

## ‚ÑπÔ∏è DataFrame Info

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   Age         5 non-null      int64
 2   Department  5 non-null      object
 3   Salary      5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

## üßÆ Group Data by Department and Calculate Mean

In [19]:
demo = df.groupby('Department').mean(numeric_only=True)
demo

             Age   Salary
Department
Finance     28.0  55000.0
HR          32.5  57500.0
IT          32.5  65000.0

## ‚öôÔ∏è Connect to MySQL Database

In [20]:
from sqlalchemy import create_engine
# engine = create_engine('sqlite://', echo=False)
engine = create_engine('mysql+pymysql://root:root@localhost:3306/demo')

## üì• Fetch Data from SQL Table

In [22]:
# Sql_Data_fetching = pd.read_sql("SELECT * FROM stu", con=engine)
# Sql_Data_fetching

## üß™ (Optional) Run Filtered SQL Queries

In [24]:
# Sql_Data_fetching = pd.read_sql("SELECT * FROM stu WHERE name LIKE '%%s%%'", con=engine)
# Sql_Data_fetching

## üìÅ Export SQL Data to Excel

In [26]:
# Sql_Data_fetching.to_excel('../Sql_Data_fetching.xlsx')

## üì§ Export Grouped Data to CSV

In [28]:
demo.to_csv('demo.csv', index=False)
# demo.to_clipboard()
# demo.to_dict()
# demo.to_sql(name='root', con=engine)

## üóëÔ∏è Delete File If Exists

In [29]:
# import os
# if os.path.exists('demo.html'):
#     os.remove('demo.html')
#     print("File deleted successfully")
# else:
#     print("File doesn't exist")

In [30]:
df.columns

Index(['Name', 'Age', 'Department', 'Salary'], dtype='object')

In [31]:
df.Age

0    25
1    30
2    28
3    35
4    40
Name: Age, dtype: int64

In [32]:
df.count()

Name          5
Age           5
Department    5
Salary        5
dtype: int64

In [33]:
df.isna()

    Name    Age  Department  Salary
0  False  False       False   False
1  False  False       False   False
2  False  False       False   False
3  False  False       False   False
4  False  False       False   False

In [34]:
df.notna()

   Name   Age  Department  Salary
0  True  True        True    True
1  True  True        True    True
2  True  True        True    True
3  True  True        True    True
4  True  True        True    True

In [35]:
df.loc[:]

      Name  Age Department  Salary
0    Alice   25         HR   50000
1      Bob   30         IT   60000
2  Charlie   28    Finance   55000
3    David   35         IT   70000
4      Eva   40         HR   65000

In [36]:
df.loc[0,'Name']='Saiyam'

In [37]:
# df.dropna()

df1 = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [5, np.nan, 7, 8],
    'C': [9, 10, 11, np.nan]
})

df1

     A    B     C
0  1.0  5.0   9.0
1  2.0  NaN  10.0
2  NaN  7.0  11.0
3  4.0  8.0   NaN

In [38]:
df1.dropna(subset='B')

     A    B     C
0  1.0  5.0   9.0
2  NaN  7.0  11.0
3  4.0  8.0   NaN

In [39]:
df1.dropna(axis=0,subset='A',inplace=True)
df1.reset_index(inplace=True,drop=True)
df1
df1.dropna(inplace=True)
df1

     A    B    C
0  1.0  5.0  9.0

In [40]:
df1.iloc[0]='Saiyam'
df1

C:\Users\saiya\AppData\Local\Temp\ipykernel_23128\1810565674.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Saiyam' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df1.iloc[0]='Saiyam'
C:\Users\saiya\AppData\Local\Temp\ipykernel_23128\1810565674.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Saiyam' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df1.iloc[0]='Saiyam'
C:\Users\saiya\AppData\Local\Temp\ipykernel_23128\1810565674.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Saiyam' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df1.iloc[0]='Saiyam'

        A       B       C
0  Saiyam  Saiyam  Saiyam

In [41]:
df1.iloc[0:3]='Shikha'
df1

        A       B       C
0  Shikha  Shikha  Shikha

In [42]:
df1[0:1]='Saiyam'
df1

        A       B       C
0  Saiyam  Saiyam  Saiyam

In [43]:
df.shape

(5, 4)

In [44]:
# df.Age.astype(int)
df=pd.to_numeric(df['Age'])
df.dtypes

dtype('int64')

In [45]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
Name: Age, dtype: bool

In [47]:
df

0    25
1    30
2    28
3    35
4    40
Name: Age, dtype: int64

In [50]:
df.transpose()

0    25
1    30
2    28
3    35
4    40
Name: Age, dtype: int64